# ==========================================
# 1. 基盤・環境定義
# ==========================================
location     = "japaneast"
environment  = "prod"

# ==========================================
# 2. コンピューティング定義 (VMスペック)
# ==========================================
vm_size      = "Standard_D2as_v4"
lb_backend_pool_name = "BackendPool-web-prod"

# ==========================================
# 3. メタデータ定義 (運用管理用)
# ==========================================
# main.tf で自動付与される項目（Environment等）を除いた「固有の値」だけを書く
tags = {
  BusinessUnit = "Production-Ops"
  CostCenter   = "WEB-101"
}